// Задача 3: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 
// Не использовать строки для расчета.

// int Prompt(string message)
// {
// System.Console.Write($"{message} >");
// int answer = Convert.ToInt32(Console.ReadLine());
// return answer;
// }

// bool ValidateNumber(int number)
// {
// if (number >= 100)
// {
// return true;
// }

// System.Console.WriteLine("Третьей цифры нет");
// return false;
// }


// int number = Prompt ("Введите число");
// int result = number / 100;
// Console.WriteLine(result);

Console.WriteLine(103%10);